Repository: NaN-tic/trytond-account_invoice_facturae_b2brouter
Catalog: locale/*.po
Languages: ca, es

# field:account.invoice,b2brouter_message:
source: B2BRouter Message
ca: Missatge B2BRouter
es: Mensaje B2BRouter

# field:account.invoice,b2brouter_state:
source: B2BRouter State
ca: B2BRouter Estat
es: B2BRouter estado

# model:ir.message,text:msg_b2brouter_state_accepted
source: Accepted
ca: Acceptada
es: Aceptada

# model:ir.message,text:msg_b2brouter_state_allegedly_paid
source: Allegedly Paid
ca: Informada com a pagada
es: Informada como a pagada

# model:ir.message,text:msg_b2brouter_state_annotated
source: Annotated
ca: Comptabilitzada
es: Contabilizada

# model:ir.message,text:msg_b2brouter_state_annulled
source: Annulled
ca: Anul·lada
es: Anulada

# model:ir.message,text:msg_b2brouter_state_billed
source: Billed
ca: Facturada
es: Facturada

# model:ir.message,text:msg_b2brouter_state_closed
source: Closed
ca: Tancada
es: Cerrada

# model:ir.message,text:msg_b2brouter_state_downloaded
source: Downloaded
ca: Descarregada
es: Descargada

# model:ir.message,text:msg_b2brouter_state_expired
source: Expired
ca: Expirada
es: Expirada

# model:ir.message,text:msg_b2brouter_state_invalid
source: Invalid
ca: Invàlida
es: Inválida

# model:ir.message,text:msg_b2brouter_state_new
source: New
ca: Nova
es: Nueva

# model:ir.message,text:msg_b2brouter_state_ocr_failed
source: OCR Failed
ca: Error de OCR
es: Fallo OCR

# model:ir.message,text:msg_b2brouter_state_paid
source: Paid
ca: Pagada
es: Pagada

# model:ir.message,text:msg_b2brouter_state_performing_ocr
source: Performing OCR
ca: Processant arxiu
es: Procesando archivo

# model:ir.message,text:msg_b2brouter_state_read
source: Read
ca: Llegida
es: Leída

# model:ir.message,text:msg_b2brouter_state_received
source: Received
ca: Rebuda
es: Recibida

# model:ir.message,text:msg_b2brouter_state_refused
source: Refused
ca: Refusada
es: Rechazada

# model:ir.message,text:msg_b2brouter_state_registered
source: Registered
ca: Registrada
es: Registrada

# model:ir.message,text:msg_b2brouter_state_sent
source: Sent
ca: Enviada
es: Enviada

# model:ir.message,text:msg_error_b2brouter
source: Error B2BRouter: "%(error)s"
es: Error B2BR: "%(error)s"

# model:ir.message,text:msg_error_delete_b2brouter
source: Error deleting invoice "%(invoice)s" through B2BRouter: "%(error)s"
ca: Error en suprimir la factura "%(invoice)s" a través de B2BRouter: "%(error)s"
es: Error al eliminar la factura "%(invoice)s" a través de B2BRouter: "%(error)s"

# model:ir.message,text:msg_error_no_certificate
source: To forward an invoice, need to deffine a default certificate in account configuration.
ca: Per reenviar una factura, cal definir un certificat per defecte a la configuració del compte.
es: Para reenviar una factura, es necesario definir un certificado predeterminado en la configuración de la cuenta.

# model:ir.message,text:msg_error_send_b2brouter
source: Error sending invoice "%(invoice)s" through B2BRouter: "%(error)s"
ca: Error en enviar la factura "%(invoice)s" a través de B2BRouter: "%(error)s"
es: Error al enviar la factura "%(invoice)s" a través de B2BRouter: "%(error)s"

# model:ir.message,text:msg_error_send_b2brouter_error
source: Error sending B2Brouter factura-e error %(invoice)s: %(error)s
ca: Error en enviar B2Brouter factura-e error %(invoice)s: %(error)s
es: Error al enviar factura-e de B2Brouter error %(invoice)s: %(error)s

# model:ir.message,text:msg_error_send_b2brouter_future
source: Forbiden action: Invoice date of invoice %(invoice)s is set in the future, and it would be sent automatically.
ca: Acció prohibida: la data de factura de la factura %(invoice)s s'estableix en el futur i s'enviarà automàticament.
es: Acción prohibida: la fecha de factura %(invoice)s se establece en el futuro y se enviará automáticamente.

# model:ir.message,text:msg_error_send_b2brouter_status
source: Error sending invoice "%(invoice)s" through B2Brouter status code: %(status_code)s %(text)s
ca: S'ha produït un error en enviar la factura "%(invoice)s" mitjançant el codi d'estat de B2Brouter: %(status_code)s %(text)s
es: Error al enviar la factura "%(invoice)s" a través del código de estado de B2Brouter: %(status_code)s %(text)s

# model:ir.message,text:msg_error_send_b2brouter_timeout
source: Error sending B2Brouter factura-e timeout %(invoice)s: %(error)s
ca: Error en enviar B2Brouter factura-e timeout %(invoice)s: %(error)s
es: Error al enviar factura-e de B2Brouter timeout %(invoice)s: %(error)s

# model:ir.model.button,string:b2brouter_forward_invoice_button
source: Forward eInvoice
es: Reenvíar factura-e

# model:ir.model.button,string:b2brouter_reset_invoice_button
source: Reset eInvoice
es: Restablecer factura-e

# model:ir.model.button,string:invoice_b2brouter_update_state_button
source: Update State
ca: Actualitza estat
es: Actualizar estado

# selection:ir.cron,method:
source: Update invoice B2BRouter state
ca: Actualitza l'estat de la factura B2BRouter
es: Actualizar el estado B2BRouter de la factura

# field:account.invoice,b2brouter_id:
source: B2BRouter ID
ca: ID B2BRouter

# model:ir.model.button,string:b2brouter_forward_invoice_button
source: Forward Invoice
ca: Reenviar factura
